[
  {
    "id": "cv_acknowledgment",
    "subject": "Thank you for your application to {{company_name}}",
    "template": "Dear {{candidate_name}},\n\nThank you for submitting your application for the {{job_title}} position at {{company_name}}. We appreciate your interest in joining our team.\n\nOur recruitment team is currently reviewing your profile and will be in touch with you soon regarding the next steps of the selection process.\n\nBased on our initial analysis of your profile:\n\n{{cv_analysis}}\n\nWe have noted the following key skills that align with this position:\n{{matching_skills}}\n\nThanks again for your interest in {{company_name}}. We look forward to potentially working with you.\n\nBest regards,\n{{consultant_name}}\nRecruitment Consultant\nRecrutementPlus"
  },
  {
    "id": "interview_invitation",
    "subject": "Interview Invitation: {{job_title}} at {{company_name}}",
    "template": "Dear {{candidate_name}},\n\nWe're pleased to inform you that after reviewing your application for the {{job_title}} position at {{company_name}}, we would like to invite you for an interview.\n\nYour profile has shown impressive strengths in the following areas:\n{{cv_analysis}}\n\nWhich particularly align with this role's requirements for:\n{{matching_skills}}\n\nCould you please let us know your availability for an interview in the coming week? The interview will last approximately 45 minutes and will be conducted via {{interview_format}}.\n\nWe look forward to discussing your qualifications and experience in more detail.\n\nBest regards,\n{{consultant_name}}\nRecruitment Consultant\nRecrutementPlus"
  },
  {
    "id": "application_rejected",
    "subject": "Update on your application for {{job_title}} at {{company_name}}",
    "template": "Dear {{candidate_name}},\n\nThank you for your interest in the {{job_title}} position at {{company_name}} and for taking the time to submit your application.\n\nAfter careful consideration of all candidates, we regret to inform you that we have decided not to proceed with your application at this time. While your profile shows strong skills in many areas, we have selected candidates whose experience more closely aligns with the specific requirements of this position.\n\nWe appreciate your interest in working with {{company_name}} and encourage you to apply for future positions that match your skills and experience. We will keep your profile in our database for future opportunities that might be a better fit.\n\nThank you again for your interest in {{company_name}}. We wish you the best in your job search and future career endeavors.\n\nBest regards,\n{{consultant_name}}\nRecruitment Consultant\nRecrutementPlus"
  },
  {
    "id": "candidate_profile_to_employer",
    "subject": "Promising Candidate for your {{job_title}} Position",
    "template": "Dear {{employer_name}},\n\nI hope this email finds you well. I'm reaching out regarding the {{job_title}} position you have open at {{company_name}}.\n\nI'm pleased to present {{candidate_name}}, a candidate whose profile is an excellent match for your requirements. Here's a brief overview of their qualifications:\n\n{{cv_summary}}\n\nKey strengths that align with your requirements:\n{{matching_skills}}\n\nI believe {{candidate_name}} would be a valuable addition to your team based on their experience and skills. Their full profile and CV are attached to this email for your review.\n\nIf you would like to proceed with this candidate, please let me know, and I'll be happy to arrange an interview or provide any additional information you may need.\n\nBest regards,\n{{consultant_name}}\nRecruitment Consultant\nRecrutementPlus\nPhone: {{consultant_phone}}"
  },
  {
    "id": "interview_confirmation",
    "subject": "Interview Confirmation: {{job_title}} at {{company_name}} - {{interview_date}}",
    "template": "Dear {{candidate_name}},\n\nThank you for confirming your availability. This email is to confirm your interview for the {{job_title}} position at {{company_name}}.\n\nInterview Details:\n- Date: {{interview_date}}\n- Time: {{interview_time}}\n- Format: {{interview_format}}\n- {{if_video_link}}Meeting Link: {{video_link}}{{/if_video_link}}\n- {{if_location}}Location: {{interview_location}}{{/if_location}}\n\nYou will be meeting with:\n{{interviewer_details}}\n\nWhat to Prepare:\n- Please review the job description thoroughly\n- Be prepared to discuss your experience with {{key_skills_focus}}\n- Consider preparing questions about the role and company\n{{if_additional_instructions}}{{additional_instructions}}{{/if_additional_instructions}}\n\nIf you need to reschedule or have any questions before the interview, please don't hesitate to contact me.\n\nGood luck with your interview! I look forward to hearing about how it goes.\n\nBest regards,\n{{consultant_name}}\nRecruitment Consultant\nRecrutementPlus\nPhone: {{consultant_phone}}"
  },
  {
    "id": "offer_letter",
    "subject": "Job Offer: {{job_title}} at {{company_name}}",
    "template": "Dear {{candidate_name}},\n\nOn behalf of {{company_name}}, I am delighted to formally offer you the position of {{job_title}}. Congratulations!\n\nFollowing your successful interviews, the team at {{company_name}} was impressed with your experience, skills, and enthusiasm. They believe you would be an excellent addition to their organization.\n\nOffer Details:\n- Position: {{job_title}}\n- Type: {{employment_type}}\n- Start Date: {{start_date}}\n- Salary: {{salary}}\n- Benefits: {{benefits}}\n- Work Location: {{work_location}}\n- Reporting to: {{reporting_manager}}\n\nThe formal offer letter from {{company_name}} is attached to this email. It contains all the specific details of your employment offer and any additional information you may need.\n\nTo accept this offer, please sign the attached offer letter and return it to us by {{response_deadline}}.\n\nIf you have any questions about the offer or need any clarification, please don't hesitate to contact me.\n\nCongratulations once again! We're thrilled for your success and have enjoyed working with you throughout this recruitment process.\n\nBest regards,\n{{consultant_name}}\nRecruitment Consultant\nRecrutementPlus\nPhone: {{consultant_phone}}"
  },
  {
    "id": "job_match_notification",
    "subject": "New Job Match: {{job_title}} at {{company_name}}",
    "template": "Dear {{candidate_name}},\n\nI hope this email finds you well. Based on your profile and preferences in our system, I'd like to bring your attention to a new job opportunity that matches your skills and career interests.\n\nJob Details:\n- Position: {{job_title}}\n- Company: {{company_name}}\n- Location: {{job_location}}\n- Type: {{employment_type}}\n- Key Requirements: {{key_requirements}}\n\nWhy This Job Might Interest You:\nBased on your profile, you have {{matching_experience}} years of experience with {{matching_skills}}, which aligns perfectly with what {{company_name}} is looking for in their ideal candidate.\n\nIf you're interested in this opportunity, please reply to this email or click the button below to express your interest. I'd be happy to provide more details and discuss the next steps.\n\n{{apply_button}}\n\nIf you're not interested in this specific opportunity but would like to continue receiving job matches, there's no need to take any action. We'll continue to notify you of relevant opportunities based on your profile.\n\nBest regards,\n{{consultant_name}}\nRecruitment Consultant\nRecrutementPlus\nPhone: {{consultant_phone}}"
  },
  {
    "id": "feedback_request",
    "subject": "Feedback Request: Your Recent Interview with {{company_name}}",
    "template": "Dear {{candidate_name}},\n\nI hope this email finds you well. I wanted to follow up regarding your recent interview for the {{job_title}} position at {{company_name}} which took place on {{interview_date}}.\n\nWe'd appreciate your feedback on the interview process to help us improve our services. Could you please share:\n\n1. How would you rate the overall interview experience (on a scale of 1-5)?\n2. Was the job description aligned with what was discussed during the interview?\n3. Did you feel adequately prepared for the interview based on the information we provided?\n4. Is there any additional information or support you would have liked from our team?\n\nAlso, please let me know if you have any questions or concerns about the position or next steps in the process. We're expecting feedback from {{company_name}} soon and will update you as soon as we hear from them.\n\nThank you for your time and cooperation.\n\nBest regards,\n{{consultant_name}}\nRecruitment Consultant\nRecrutementPlus\nPhone: {{consultant_phone}}"
  },
  {
    "id": "interview_reminder",
    "subject": "Reminder: Your Interview for {{job_title}} at {{company_name}} Tomorrow",
    "template": "Dear {{candidate_name}},\n\nThis is a friendly reminder that your interview for the {{job_title}} position at {{company_name}} is scheduled for tomorrow, {{interview_date}} at {{interview_time}}.\n\nInterview Details:\n- Format: {{interview_format}}\n- {{if_video_link}}Meeting Link: {{video_link}}{{/if_video_link}}\n- {{if_location}}Location: {{interview_location}}{{/if_location}}\n- Duration: Approximately 45 minutes\n\nReminder of what to prepare:\n- Review the job description and your application\n- Be prepared to discuss your experience with {{key_skills_focus}}\n- Have some questions ready about the role and company\n- If it's a video interview, please test your equipment in advance\n\nIf you need to reschedule or have any last-minute questions, please contact me as soon as possible.\n\nGood luck with your interview! I'm confident you will do well.\n\nBest regards,\n{{consultant_name}}\nRecruitment Consultant\nRecrutementPlus\nPhone: {{consultant_phone}}"
  }
]